const falList = [

{
    poet: "مولانا",

    poem: `هر کسی کو دور ماند از اصل خویش
باز جوید روزگار وصل خویش`,

    meaning:
    "شاید این روزها احساس می‌کنی چیزی در زندگی کم است؛ وقتش رسیده دوباره به آرزوها و چیزهایی که واقعاً دوستشان داری برگردی."
},

{
    poet: "حافظ",

    poem: `صلاح کار کجا و من خراب کجا
ببین تفاوت ره از کجاست تا به کجا`,

    meaning:
    "خودت را با دیگران مقایسه نکن؛ هر کسی مسیر مخصوص خودش را دارد."
},

{
    poet: "سعدی",

    poem: `بنی‌آدم اعضای یکدیگرند
که در آفرینش ز یک گوهرند`,

    meaning:
    "امروز اگر بتوانی حال یک نفر را بهتر کنی، احتمالاً حال خودت هم بهتر خواهد شد."
},

{
    poet: "سهراب سپهری",

    poem: `چشم‌ها را باید شست
جور دیگر باید دید`,

    meaning:
    "شاید مسئله‌ای که ذهنت را درگیر کرده فقط به یک زاویه دید تازه نیاز داشته باشد."
},

{
    poet: "فروغ فرخزاد",

    poem: `تنها صداست که می‌ماند`,

    meaning:
    "از بیان احساساتت نترس؛ گاهی یک حرف صادقانه بیشتر از سکوت ارزش دارد."
},

{
    poet: "فردوسی",

    poem: `توانا بود هر که دانا بود
ز دانش دل پیر برنا بود`,

    meaning:
    "امروز یاد گرفتن یک چیز جدید می‌تواند مسیر آینده‌ات را تغییر دهد."
},

{
    poet: "خیام",

    poem: `این قافله عمر عجب می‌گذرد
دریاب دمی که با طرب می‌گذرد`,

    meaning:
    "بیش از حد نگران آینده نباش؛ از امروزت هم لذت ببر."
},

{
    poet: "پروین اعتصامی",

    poem: `دانش چو چراغ روشن است`,

    meaning:
    "دانش و آگاهی همیشه بهترین سرمایه‌ای است که می‌توانی برای خودت بسازی."
},

{
    poet: "نیما یوشیج",

    poem: `خانه‌ام ابری است`,

    meaning:
    "اگر امروز حالت خوب نیست، یادت باشد هیچ ابری همیشگی نیست."
},

{
    poet: "شهریار",

    poem: `آمدی جانم به قربانت ولی حالا چرا`,

    meaning:
    "گاهی باید احساساتت را زودتر بیان کنی؛ فرصت‌ها همیشه منتظر نمی‌مانند."
}

];

const btn = document.getElementById("falBtn");

btn.addEventListener("click", function () {

    let randomIndex = Math.floor(Math.random() * falList.length);

    let fal = falList[randomIndex];

    document.getElementById("poetName").innerHTML =
        "🌸 فال امروز از " + fal.poet;

    document.getElementById("poem").innerHTML =
        "<strong>📜 شعر:</strong><br><br>" +
        fal.poem.replace(/\n/g, "<br>");

    document.getElementById("meaning").innerHTML =
        "<strong>✨ برداشت امروزی:</strong><br><br>" +
        fal.meaning;

});